import { FancyDate, PLANET, SATELLITE, STAR, SPOT } from './fancy-date'
export declare const 九星: readonly [
  '九紫火',
  '八白土',
  '七赤金',
  '六白金',
  '五黄土',
  '四緑木',
  '三碧木',
  '二黒土',
  '一白水'
]
export declare const 九曜: readonly [
  '羅睺',
  '土曜',
  '水曜',
  '金曜',
  '日曜',
  '火曜',
  '計都',
  '月曜',
  '木曜'
]
export declare const 七曜: readonly ['月', '火', '水', '木', '金', '土', '日']
export declare const 六曜: readonly ['先勝', '友引', '先負', '仏滅', '大安', '赤口']
export declare const 東方青龍: readonly ['角', '亢', '氐', '房', '心', '尾', '箕']
export declare const 北方玄武: readonly ['斗', '牛', '女', '虚', '危', '室', '壁']
export declare const 西方百虎: readonly ['奎', '婁', '胃', '昴', '畢', '觜', '参']
export declare const 南方朱雀: readonly ['井', '鬼', '柳', '星', '張', '翼', '軫']
export declare const 二十八宿: readonly [
  '角',
  '亢',
  '氐',
  '房',
  '心',
  '尾',
  '箕',
  '斗',
  '牛',
  '女',
  '虚',
  '危',
  '室',
  '壁',
  '奎',
  '婁',
  '胃',
  '昴',
  '畢',
  '觜',
  '参',
  '井',
  '鬼',
  '柳',
  '星',
  '張',
  '翼',
  '軫'
]
export declare const 二十七宿: readonly [
  '角',
  '亢',
  '氐',
  '房',
  '心',
  '尾',
  '箕',
  '斗',
  '女',
  '虚',
  '危',
  '室',
  '壁',
  '奎',
  '婁',
  '胃',
  '昴',
  '畢',
  '觜',
  '参',
  '井',
  '鬼',
  '柳',
  '星',
  '張',
  '翼',
  '軫'
]
export declare const 九星かな: readonly [
  'きゅうしか',
  'はっぱくど',
  'しちせききん',
  'ろっぱくきん',
  'ごおうど',
  'しろくもく',
  'さんぺきもく',
  'じこくど',
  'いっぱくすい'
]
export declare const 九曜かな: readonly [
  'らごう',
  'どよう',
  'すいよう',
  'きんよう',
  'にちよう',
  'かよう',
  'けいと',
  'げつよう',
  'もくよう'
]
export declare const 七曜かな: readonly ['げつ', 'か', 'すい', 'もく', 'きん', 'ど', 'にち']
export declare const 六曜かな: readonly [
  'せんかち',
  'ともびき',
  'せんまけ',
  'ぶつめつ',
  'たいあん',
  'しゃっく'
]
export declare const 東方青龍かな: readonly [
  'す',
  'あみ',
  'とも',
  'そい',
  'なかご',
  'あしたれ',
  'み'
]
export declare const 北方玄武かな: readonly [
  'ひきつ',
  'いなみ',
  'うるき',
  'とみて',
  'うみやめ',
  'はつい',
  'なまめ'
]
export declare const 西方百虎かな: readonly [
  'とかき',
  'たたら',
  'えきえ',
  'すばる',
  'あめふり',
  'とろき',
  'からすき'
]
export declare const 南方朱雀かな: readonly [
  'ちちり',
  'たまほめ',
  'ぬりこ',
  'ほとおり',
  'ちりこ',
  'たすき',
  'みつかけ'
]
export declare const 二十八宿かな: readonly [
  'す',
  'あみ',
  'とも',
  'そい',
  'なかご',
  'あしたれ',
  'み',
  'ひきつ',
  'いなみ',
  'うるき',
  'とみて',
  'うみやめ',
  'はつい',
  'なまめ',
  'とかき',
  'たたら',
  'えきえ',
  'すばる',
  'あめふり',
  'とろき',
  'からすき',
  'ちちり',
  'たまほめ',
  'ぬりこ',
  'ほとおり',
  'ちりこ',
  'たすき',
  'みつかけ'
]
export declare const 二十七宿かな: readonly [
  'す',
  'あみ',
  'とも',
  'そい',
  'なかご',
  'あしたれ',
  'み',
  'ひきつ',
  'うるき',
  'とみて',
  'うみやめ',
  'はつい',
  'なまめ',
  'とかき',
  'たたら',
  'えきえ',
  'すばる',
  'あめふり',
  'とろき',
  'からすき',
  'ちちり',
  'たまほめ',
  'ぬりこ',
  'ほとおり',
  'ちりこ',
  'たすき',
  'みつかけ'
]
export declare const 月相: readonly [
  '朔',
  '既朔',
  '三日月',
  '上弦',
  '上弦',
  '上弦',
  '上弦',
  '上弦',
  '上弦',
  '上弦',
  '上弦',
  '上弦',
  '十三夜',
  '小望月',
  '満月',
  '十六夜',
  '立待月',
  '居待月',
  '臥待月',
  '更待月',
  '下限',
  '下限',
  '下限',
  '下限',
  '下限',
  '下限',
  '下限',
  '下限',
  '晦',
  '晦'
]
export declare const 時鐘: readonly [
  '暁九ツ',
  '暁八ツ',
  '暁七ツ',
  '明六ツ',
  '朝五ツ',
  '朝四ツ',
  '昼九ツ',
  '昼八ツ',
  '昼七ツ',
  '暮六ツ',
  '夜五ツ',
  '夜四ツ'
]
export declare const 月相かな: readonly [
  'さく',
  'きさく',
  'みかづき',
  'じょうげん',
  'じょうげん',
  'じょうげん',
  'じょうげん',
  'じょうげん',
  'じょうげん',
  'じょうげん',
  'じょうげん',
  'じょうげん',
  'じゅうさんや',
  'こもちづき',
  'まんげつ',
  'いざよい',
  'たちまちづき',
  'いまちづき',
  'ふしまちづき',
  'ふけまちづき',
  'かげん',
  'かげん',
  'かげん',
  'かげん',
  'かげん',
  'かげん',
  'かげん',
  'かげん',
  'つごもり',
  'つごもり'
]
export declare const 時鐘かな: readonly [
  'ぎょうここのつ',
  'ぎょうやつ',
  'ぎょうななつ',
  'あけむつ',
  'あさいつつ',
  'あさよつ',
  'ひるここのつ',
  'ひるやつ',
  'ひるななつ',
  'くれむつ',
  'よるいつつ',
  'よるよつ'
]
export declare const 和風月名: readonly [
  '睦月',
  '如月',
  '弥生',
  '卯月',
  '皐月',
  '水無月',
  '文月',
  '葉月',
  '長月',
  '神無月',
  '霜月',
  '師走'
]
export declare const 二十四節季: readonly [
  '立春',
  '雨水',
  '啓蟄',
  '春分',
  '清明',
  '穀雨',
  '立夏',
  '小満',
  '芒種',
  '夏至',
  '小暑',
  '大暑',
  '立秋',
  '処暑',
  '白露',
  '秋分',
  '寒露',
  '霜降',
  '立冬',
  '小雪',
  '大雪',
  '冬至',
  '小寒',
  '大寒'
]
export declare const 和風月名かな: readonly [
  'むつき',
  'きさらぎ',
  'やよい',
  'うづき',
  'さつき',
  'みなつき',
  'ふみつき',
  'はつき',
  'ながつき',
  'かんなづき',
  'しもつき',
  'しわす'
]
export declare const 二十四節季かな: readonly [
  'りっしゅん',
  'うすい',
  'けいちつ',
  'しゅんぶん',
  'せいめい',
  'こくう',
  'りっか',
  'しょうまん',
  'ぼうしゅ',
  'げし',
  'しょうしょ',
  'たいしょ',
  'りっしゅう',
  'しょしょ',
  'はくろ',
  'しゅうぶん',
  'かんろ',
  'そうこう',
  'りっとう',
  'しょうせつ',
  'たいせつ',
  'とうじ',
  'しょうかん',
  'だいかん'
]
export declare const 十干: readonly ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']
export declare const 十二支: readonly [
  '子',
  '丑',
  '寅',
  '卯',
  '辰',
  '巳',
  '午',
  '未',
  '申',
  '酉',
  '戌',
  '亥'
]
export declare const 十干かな: readonly [
  'きのえ',
  'きのと',
  'ひのえ',
  'ひのと',
  'つちのえ',
  'つちのと',
  'かのえ',
  'かのと',
  'みずのえ',
  'みずのと'
]
export declare const 十二支かな: readonly [
  'ね',
  'うし',
  'とら',
  'う',
  'たつ',
  'み',
  'うま',
  'ひつじ',
  'さる',
  'とり',
  'いぬ',
  'い'
]
export declare const 元号: readonly [
  readonly ['大化', -41795686800000],
  readonly ['白雉', -41648029200000],
  readonly ['朱鳥', -40499427600000],
  readonly ['大宝', -40034941200000],
  readonly ['慶雲', -39936445200000],
  readonly ['和銅', -39821446800000],
  readonly ['霊亀', -39579958800000],
  readonly ['養老', -39509715600000],
  readonly ['神亀', -39314365200000],
  readonly ['天平', -39140787600000],
  readonly ['天平感宝', -38520090000000],
  readonly ['天平勝宝', -38510845200000],
  readonly ['天平宝字', -38256829200000],
  readonly ['天平神護', -38023117200000],
  readonly ['神護景雲', -37940691600000],
  readonly ['宝亀', -37842541200000],
  readonly ['天応', -37518368400000],
  readonly ['延暦', -37465837200000],
  readonly ['大同', -36718304400000],
  readonly ['弘仁', -36580496400000],
  readonly ['天長', -36160678800000],
  readonly ['承和', -35844541200000],
  readonly ['嘉祥', -35389558800000],
  readonly ['仁寿', -35298838800000],
  readonly ['斉衡', -35186432400000],
  readonly ['天安', -35115757200000],
  readonly ['貞観', -35047414800000],
  readonly ['元慶', -34478298000000],
  readonly ['仁和', -34232922000000],
  readonly ['寛平', -34099779600000],
  readonly ['昌泰', -33816646800000],
  readonly ['延喜', -33713053200000],
  readonly ['延長', -33026950800000],
  readonly ['承平', -32775613200000],
  readonly ['天慶', -32551491600000],
  readonly ['天暦', -32270778000000],
  readonly ['天徳', -31938742800000],
  readonly ['応和', -31835062800000],
  readonly ['康保', -31725939600000],
  readonly ['安和', -31597981200000],
  readonly ['天禄', -31545968400000],
  readonly ['天延', -31428982800000],
  readonly ['貞元', -31347939600000],
  readonly ['天元', -31272598800000],
  readonly ['永観', -31133494800000],
  readonly ['寛和', -31071200400000],
  readonly ['永延', -31009338000000],
  readonly ['永祚', -30935120400000],
  readonly ['正暦', -30896931600000],
  readonly ['長徳', -30760419600000],
  readonly ['長保', -30638682000000],
  readonly ['寛弘', -30464586000000],
  readonly ['長和', -30196227600000],
  readonly ['寛仁', -30061184400000],
  readonly ['治安', -29940570000000],
  readonly ['万寿', -29832483600000],
  readonly ['長元', -29706339600000],
  readonly ['長暦', -29431069200000],
  readonly ['長久', -29317280400000],
  readonly ['寛徳', -29191050000000],
  readonly ['永承', -29145949200000],
  readonly ['天喜', -28934442000000],
  readonly ['康平', -28756890000000],
  readonly ['治暦', -28537261200000],
  readonly ['延久', -28421485200000],
  readonly ['承保', -28252227600000],
  readonly ['承暦', -28150621200000],
  readonly ['永保', -28046682000000],
  readonly ['応徳', -27952592400000],
  readonly ['寛治', -27853059600000],
  readonly ['嘉保', -27609930000000],
  readonly ['永長', -27548499600000],
  readonly ['承徳', -27517568400000],
  readonly ['康和', -27463395600000],
  readonly ['長治', -27322045200000],
  readonly ['嘉承', -27253270800000],
  readonly ['天仁', -27179830800000],
  readonly ['天永', -27120214800000],
  readonly ['永久', -27023360400000],
  readonly ['元永', -26876134800000],
  readonly ['保安', -26811766800000],
  readonly ['天治', -26684758800000],
  readonly ['大治', -26629635600000],
  readonly ['天承', -26470746000000],
  readonly ['長承', -26421411600000],
  readonly ['保延', -26335702800000],
  readonly ['永治', -26140784400000],
  readonly ['康治', -26116160400000],
  readonly ['天養', -26058013200000],
  readonly ['久安', -26014640400000],
  readonly ['仁平', -25840803600000],
  readonly ['久寿', -25720794000000],
  readonly ['保元', -25674915600000],
  readonly ['平治', -25581085200000],
  readonly ['永暦', -25556461200000],
  readonly ['応保', -25506003600000],
  readonly ['長寛', -25455286800000],
  readonly ['永万', -25385994000000],
  readonly ['仁安', -25348323600000],
  readonly ['嘉応', -25265725200000],
  readonly ['承安', -25200838800000],
  readonly ['安元', -25067610000000],
  readonly ['治承', -25003328400000],
  readonly ['養和', -24877443600000],
  readonly ['寿永', -24850832400000],
  readonly ['元暦', -24790525200000],
  readonly ['文治', -24749917200000],
  readonly ['建久', -24602173200000],
  readonly ['正治', -24317571600000],
  readonly ['建仁', -24260029200000],
  readonly ['元久', -24164989200000],
  readonly ['建永', -24095523600000],
  readonly ['承元', -24049818000000],
  readonly ['建暦', -23941472400000],
  readonly ['建保', -23854986000000],
  readonly ['承久', -23686074000000],
  readonly ['貞応', -23591552400000],
  readonly ['元仁', -23509386000000],
  readonly ['嘉禄', -23496598800000],
  readonly ['安貞', -23413222800000],
  readonly ['寛喜', -23375379600000],
  readonly ['貞永', -23278698000000],
  readonly ['天福', -23244397200000],
  readonly ['文暦', -23196790800000],
  readonly ['嘉禎', -23167501200000],
  readonly ['暦仁', -23067709200000],
  readonly ['延応', -23061402000000],
  readonly ['仁治', -23017251600000],
  readonly ['寛元', -22934739600000],
  readonly ['宝治', -22806954000000],
  readonly ['建長', -22741462800000],
  readonly ['康元', -22505418000000],
  readonly ['正嘉', -22491766800000],
  readonly ['正元', -22426966800000],
  readonly ['文応', -22392406800000],
  readonly ['弘長', -22366314000000],
  readonly ['文永', -22271187600000],
  readonly ['建治', -21919280400000],
  readonly ['弘安', -21829770000000],
  readonly ['正応', -21508362000000],
  readonly ['永仁', -21341955600000],
  readonly ['正安', -21161638800000],
  readonly ['乾元', -21049750800000],
  readonly ['嘉元', -21025558800000],
  readonly ['徳治', -20920150800000],
  readonly ['延慶', -20861917200000],
  readonly ['応長', -20783638800000],
  readonly ['正和', -20753744400000],
  readonly ['文保', -20599606800000],
  readonly ['元応', -20531091600000],
  readonly ['元亨', -20472858000000],
  readonly ['正中', -20354144400000],
  readonly ['嘉暦', -20309302800000],
  readonly ['元徳', -20204499600000],
  readonly ['元弘', -20142378000000, '南'],
  readonly ['正慶', -20120346000000, '北'],
  readonly ['建武', -20064099600000],
  readonly ['延元', -19997744400000, '南'],
  readonly ['興国', -19867712400000, '南'],
  readonly ['正平', -19657674000000, '南'],
  readonly ['建徳', -18913856400000, '南'],
  readonly ['文中', -18859942800000, '南'],
  readonly ['天授', -18760496400000, '南'],
  readonly ['弘和', -18580784400000, '南'],
  readonly ['元中', -18479782800000, '南'],
  readonly ['暦応', -19918861200000, '北'],
  readonly ['康永', -19804035600000, '北'],
  readonly ['貞和', -19694912400000, '北'],
  readonly ['観応', -19556586000000, '北'],
  readonly ['文和', -19474938000000, '北'],
  readonly ['延文', -19365037200000, '北'],
  readonly ['康安', -19206838800000, '北'],
  readonly ['貞治', -19161478800000, '北'],
  readonly ['応安', -18990925200000, '北'],
  readonly ['永和', -18768186000000, '北'],
  readonly ['康暦', -18641005200000, '北'],
  readonly ['永徳', -18579574800000, '北'],
  readonly ['至徳', -18484966800000, '北'],
  readonly ['嘉慶', -18373078800000, '北'],
  readonly ['康応', -18328237200000, '北'],
  readonly ['明徳', -18293590800000, '北'],
  readonly ['応永', -18157683600000],
  readonly ['正長', -17089261200000],
  readonly ['永享', -17047789200000],
  readonly ['嘉吉', -16686982800000],
  readonly ['文安', -16593670800000],
  readonly ['宝徳', -16420784400000],
  readonly ['享徳', -16326608400000],
  readonly ['康正', -16229667600000],
  readonly ['長禄', -16163053200000],
  readonly ['寛正', -16059027600000],
  readonly ['文正', -15897718800000],
  readonly ['応仁', -15863936400000],
  readonly ['文明', -15795594000000],
  readonly ['長享', -15222243600000],
  readonly ['延徳', -15155802000000],
  readonly ['明応', -15064131600000],
  readonly ['文亀', -14792835600000],
  readonly ['永正', -14698314000000],
  readonly ['大永', -14145354000000],
  readonly ['享禄', -13926157200000],
  readonly ['天文', -13800358800000],
  readonly ['弘治', -13068550800000],
  readonly ['永禄', -12994074000000],
  readonly ['元亀', -12609334800000],
  readonly ['天正', -12506864400000],
  readonly ['文禄', -11896189200000],
  readonly ['慶長', -11772118800000],
  readonly ['元和', -11181402000000],
  readonly ['寛永', -10909501200000],
  readonly ['正保', -10254934800000],
  readonly ['慶安', -10152982800000],
  readonly ['承応', -10009818000000],
  readonly ['明暦', -9928602000000],
  readonly ['万治', -9825699600000],
  readonly ['寛文', -9738781200000],
  readonly ['延宝', -9346266000000],
  readonly ['天和', -9092941200000],
  readonly ['貞享', -9017082000000],
  readonly ['元禄', -8873485200000],
  readonly ['宝永', -8385066000000],
  readonly ['正徳', -8159389200000],
  readonly ['享保', -7996438800000],
  readonly ['元文', -7370730000000],
  readonly ['寛保', -7217802000000],
  readonly ['延享', -7123885200000],
  readonly ['寛延', -6986941200000],
  readonly ['宝暦', -6881014800000],
  readonly ['明和', -6485130000000],
  readonly ['安永', -6218586000000],
  readonly ['天明', -5954374800000],
  readonly ['寛政', -5707530000000],
  readonly ['享和', -5326506000000],
  readonly ['文化', -5231552400000],
  readonly ['文政', -4784173200000],
  readonly ['天保', -4384573200000],
  readonly ['弘化', -3943933200000],
  readonly ['嘉永', -3842154000000],
  readonly ['安政', -3627882000000],
  readonly ['万延', -3462858000000],
  readonly ['文久', -3432186000000],
  readonly ['元治', -3337664400000],
  readonly ['慶応', -3303104400000],
  readonly ['明治', -3216790800000],
  readonly ['大正', -1812186000000],
  readonly ['昭和', -1357635600000],
  readonly ['平成', 600188400000],
  readonly ['令和', 1556636400000]
]
export declare const 北朝元号: (
  | readonly ['大化', -41795686800000]
  | readonly ['白雉', -41648029200000]
  | readonly ['朱鳥', -40499427600000]
  | readonly ['大宝', -40034941200000]
  | readonly ['慶雲', -39936445200000]
  | readonly ['和銅', -39821446800000]
  | readonly ['霊亀', -39579958800000]
  | readonly ['養老', -39509715600000]
  | readonly ['神亀', -39314365200000]
  | readonly ['天平', -39140787600000]
  | readonly ['天平感宝', -38520090000000]
  | readonly ['天平勝宝', -38510845200000]
  | readonly ['天平宝字', -38256829200000]
  | readonly ['天平神護', -38023117200000]
  | readonly ['神護景雲', -37940691600000]
  | readonly ['宝亀', -37842541200000]
  | readonly ['天応', -37518368400000]
  | readonly ['延暦', -37465837200000]
  | readonly ['大同', -36718304400000]
  | readonly ['弘仁', -36580496400000]
  | readonly ['天長', -36160678800000]
  | readonly ['承和', -35844541200000]
  | readonly ['嘉祥', -35389558800000]
  | readonly ['仁寿', -35298838800000]
  | readonly ['斉衡', -35186432400000]
  | readonly ['天安', -35115757200000]
  | readonly ['貞観', -35047414800000]
  | readonly ['元慶', -34478298000000]
  | readonly ['仁和', -34232922000000]
  | readonly ['寛平', -34099779600000]
  | readonly ['昌泰', -33816646800000]
  | readonly ['延喜', -33713053200000]
  | readonly ['延長', -33026950800000]
  | readonly ['承平', -32775613200000]
  | readonly ['天慶', -32551491600000]
  | readonly ['天暦', -32270778000000]
  | readonly ['天徳', -31938742800000]
  | readonly ['応和', -31835062800000]
  | readonly ['康保', -31725939600000]
  | readonly ['安和', -31597981200000]
  | readonly ['天禄', -31545968400000]
  | readonly ['天延', -31428982800000]
  | readonly ['貞元', -31347939600000]
  | readonly ['天元', -31272598800000]
  | readonly ['永観', -31133494800000]
  | readonly ['寛和', -31071200400000]
  | readonly ['永延', -31009338000000]
  | readonly ['永祚', -30935120400000]
  | readonly ['正暦', -30896931600000]
  | readonly ['長徳', -30760419600000]
  | readonly ['長保', -30638682000000]
  | readonly ['寛弘', -30464586000000]
  | readonly ['長和', -30196227600000]
  | readonly ['寛仁', -30061184400000]
  | readonly ['治安', -29940570000000]
  | readonly ['万寿', -29832483600000]
  | readonly ['長元', -29706339600000]
  | readonly ['長暦', -29431069200000]
  | readonly ['長久', -29317280400000]
  | readonly ['寛徳', -29191050000000]
  | readonly ['永承', -29145949200000]
  | readonly ['天喜', -28934442000000]
  | readonly ['康平', -28756890000000]
  | readonly ['治暦', -28537261200000]
  | readonly ['延久', -28421485200000]
  | readonly ['承保', -28252227600000]
  | readonly ['承暦', -28150621200000]
  | readonly ['永保', -28046682000000]
  | readonly ['応徳', -27952592400000]
  | readonly ['寛治', -27853059600000]
  | readonly ['嘉保', -27609930000000]
  | readonly ['永長', -27548499600000]
  | readonly ['承徳', -27517568400000]
  | readonly ['康和', -27463395600000]
  | readonly ['長治', -27322045200000]
  | readonly ['嘉承', -27253270800000]
  | readonly ['天仁', -27179830800000]
  | readonly ['天永', -27120214800000]
  | readonly ['永久', -27023360400000]
  | readonly ['元永', -26876134800000]
  | readonly ['保安', -26811766800000]
  | readonly ['天治', -26684758800000]
  | readonly ['大治', -26629635600000]
  | readonly ['天承', -26470746000000]
  | readonly ['長承', -26421411600000]
  | readonly ['保延', -26335702800000]
  | readonly ['永治', -26140784400000]
  | readonly ['康治', -26116160400000]
  | readonly ['天養', -26058013200000]
  | readonly ['久安', -26014640400000]
  | readonly ['仁平', -25840803600000]
  | readonly ['久寿', -25720794000000]
  | readonly ['保元', -25674915600000]
  | readonly ['平治', -25581085200000]
  | readonly ['永暦', -25556461200000]
  | readonly ['応保', -25506003600000]
  | readonly ['長寛', -25455286800000]
  | readonly ['永万', -25385994000000]
  | readonly ['仁安', -25348323600000]
  | readonly ['嘉応', -25265725200000]
  | readonly ['承安', -25200838800000]
  | readonly ['安元', -25067610000000]
  | readonly ['治承', -25003328400000]
  | readonly ['養和', -24877443600000]
  | readonly ['寿永', -24850832400000]
  | readonly ['元暦', -24790525200000]
  | readonly ['文治', -24749917200000]
  | readonly ['建久', -24602173200000]
  | readonly ['正治', -24317571600000]
  | readonly ['建仁', -24260029200000]
  | readonly ['元久', -24164989200000]
  | readonly ['建永', -24095523600000]
  | readonly ['承元', -24049818000000]
  | readonly ['建暦', -23941472400000]
  | readonly ['建保', -23854986000000]
  | readonly ['承久', -23686074000000]
  | readonly ['貞応', -23591552400000]
  | readonly ['元仁', -23509386000000]
  | readonly ['嘉禄', -23496598800000]
  | readonly ['安貞', -23413222800000]
  | readonly ['寛喜', -23375379600000]
  | readonly ['貞永', -23278698000000]
  | readonly ['天福', -23244397200000]
  | readonly ['文暦', -23196790800000]
  | readonly ['嘉禎', -23167501200000]
  | readonly ['暦仁', -23067709200000]
  | readonly ['延応', -23061402000000]
  | readonly ['仁治', -23017251600000]
  | readonly ['寛元', -22934739600000]
  | readonly ['宝治', -22806954000000]
  | readonly ['建長', -22741462800000]
  | readonly ['康元', -22505418000000]
  | readonly ['正嘉', -22491766800000]
  | readonly ['正元', -22426966800000]
  | readonly ['文応', -22392406800000]
  | readonly ['弘長', -22366314000000]
  | readonly ['文永', -22271187600000]
  | readonly ['建治', -21919280400000]
  | readonly ['弘安', -21829770000000]
  | readonly ['正応', -21508362000000]
  | readonly ['永仁', -21341955600000]
  | readonly ['正安', -21161638800000]
  | readonly ['乾元', -21049750800000]
  | readonly ['嘉元', -21025558800000]
  | readonly ['徳治', -20920150800000]
  | readonly ['延慶', -20861917200000]
  | readonly ['応長', -20783638800000]
  | readonly ['正和', -20753744400000]
  | readonly ['文保', -20599606800000]
  | readonly ['元応', -20531091600000]
  | readonly ['元亨', -20472858000000]
  | readonly ['正中', -20354144400000]
  | readonly ['嘉暦', -20309302800000]
  | readonly ['元徳', -20204499600000]
  | readonly ['元弘', -20142378000000, '南']
  | readonly ['正慶', -20120346000000, '北']
  | readonly ['建武', -20064099600000]
  | readonly ['延元', -19997744400000, '南']
  | readonly ['興国', -19867712400000, '南']
  | readonly ['正平', -19657674000000, '南']
  | readonly ['建徳', -18913856400000, '南']
  | readonly ['文中', -18859942800000, '南']
  | readonly ['天授', -18760496400000, '南']
  | readonly ['弘和', -18580784400000, '南']
  | readonly ['元中', -18479782800000, '南']
  | readonly ['暦応', -19918861200000, '北']
  | readonly ['康永', -19804035600000, '北']
  | readonly ['貞和', -19694912400000, '北']
  | readonly ['観応', -19556586000000, '北']
  | readonly ['文和', -19474938000000, '北']
  | readonly ['延文', -19365037200000, '北']
  | readonly ['康安', -19206838800000, '北']
  | readonly ['貞治', -19161478800000, '北']
  | readonly ['応安', -18990925200000, '北']
  | readonly ['永和', -18768186000000, '北']
  | readonly ['康暦', -18641005200000, '北']
  | readonly ['永徳', -18579574800000, '北']
  | readonly ['至徳', -18484966800000, '北']
  | readonly ['嘉慶', -18373078800000, '北']
  | readonly ['康応', -18328237200000, '北']
  | readonly ['明徳', -18293590800000, '北']
  | readonly ['応永', -18157683600000]
  | readonly ['正長', -17089261200000]
  | readonly ['永享', -17047789200000]
  | readonly ['嘉吉', -16686982800000]
  | readonly ['文安', -16593670800000]
  | readonly ['宝徳', -16420784400000]
  | readonly ['享徳', -16326608400000]
  | readonly ['康正', -16229667600000]
  | readonly ['長禄', -16163053200000]
  | readonly ['寛正', -16059027600000]
  | readonly ['文正', -15897718800000]
  | readonly ['応仁', -15863936400000]
  | readonly ['文明', -15795594000000]
  | readonly ['長享', -15222243600000]
  | readonly ['延徳', -15155802000000]
  | readonly ['明応', -15064131600000]
  | readonly ['文亀', -14792835600000]
  | readonly ['永正', -14698314000000]
  | readonly ['大永', -14145354000000]
  | readonly ['享禄', -13926157200000]
  | readonly ['天文', -13800358800000]
  | readonly ['弘治', -13068550800000]
  | readonly ['永禄', -12994074000000]
  | readonly ['元亀', -12609334800000]
  | readonly ['天正', -12506864400000]
  | readonly ['文禄', -11896189200000]
  | readonly ['慶長', -11772118800000]
  | readonly ['元和', -11181402000000]
  | readonly ['寛永', -10909501200000]
  | readonly ['正保', -10254934800000]
  | readonly ['慶安', -10152982800000]
  | readonly ['承応', -10009818000000]
  | readonly ['明暦', -9928602000000]
  | readonly ['万治', -9825699600000]
  | readonly ['寛文', -9738781200000]
  | readonly ['延宝', -9346266000000]
  | readonly ['天和', -9092941200000]
  | readonly ['貞享', -9017082000000]
  | readonly ['元禄', -8873485200000]
  | readonly ['宝永', -8385066000000]
  | readonly ['正徳', -8159389200000]
  | readonly ['享保', -7996438800000]
  | readonly ['元文', -7370730000000]
  | readonly ['寛保', -7217802000000]
  | readonly ['延享', -7123885200000]
  | readonly ['寛延', -6986941200000]
  | readonly ['宝暦', -6881014800000]
  | readonly ['明和', -6485130000000]
  | readonly ['安永', -6218586000000]
  | readonly ['天明', -5954374800000]
  | readonly ['寛政', -5707530000000]
  | readonly ['享和', -5326506000000]
  | readonly ['文化', -5231552400000]
  | readonly ['文政', -4784173200000]
  | readonly ['天保', -4384573200000]
  | readonly ['弘化', -3943933200000]
  | readonly ['嘉永', -3842154000000]
  | readonly ['安政', -3627882000000]
  | readonly ['万延', -3462858000000]
  | readonly ['文久', -3432186000000]
  | readonly ['元治', -3337664400000]
  | readonly ['慶応', -3303104400000]
  | readonly ['明治', -3216790800000]
  | readonly ['大正', -1812186000000]
  | readonly ['昭和', -1357635600000]
  | readonly ['平成', 600188400000]
  | readonly ['令和', 1556636400000]
)[]
export declare const 南朝元号: (
  | readonly ['大化', -41795686800000]
  | readonly ['白雉', -41648029200000]
  | readonly ['朱鳥', -40499427600000]
  | readonly ['大宝', -40034941200000]
  | readonly ['慶雲', -39936445200000]
  | readonly ['和銅', -39821446800000]
  | readonly ['霊亀', -39579958800000]
  | readonly ['養老', -39509715600000]
  | readonly ['神亀', -39314365200000]
  | readonly ['天平', -39140787600000]
  | readonly ['天平感宝', -38520090000000]
  | readonly ['天平勝宝', -38510845200000]
  | readonly ['天平宝字', -38256829200000]
  | readonly ['天平神護', -38023117200000]
  | readonly ['神護景雲', -37940691600000]
  | readonly ['宝亀', -37842541200000]
  | readonly ['天応', -37518368400000]
  | readonly ['延暦', -37465837200000]
  | readonly ['大同', -36718304400000]
  | readonly ['弘仁', -36580496400000]
  | readonly ['天長', -36160678800000]
  | readonly ['承和', -35844541200000]
  | readonly ['嘉祥', -35389558800000]
  | readonly ['仁寿', -35298838800000]
  | readonly ['斉衡', -35186432400000]
  | readonly ['天安', -35115757200000]
  | readonly ['貞観', -35047414800000]
  | readonly ['元慶', -34478298000000]
  | readonly ['仁和', -34232922000000]
  | readonly ['寛平', -34099779600000]
  | readonly ['昌泰', -33816646800000]
  | readonly ['延喜', -33713053200000]
  | readonly ['延長', -33026950800000]
  | readonly ['承平', -32775613200000]
  | readonly ['天慶', -32551491600000]
  | readonly ['天暦', -32270778000000]
  | readonly ['天徳', -31938742800000]
  | readonly ['応和', -31835062800000]
  | readonly ['康保', -31725939600000]
  | readonly ['安和', -31597981200000]
  | readonly ['天禄', -31545968400000]
  | readonly ['天延', -31428982800000]
  | readonly ['貞元', -31347939600000]
  | readonly ['天元', -31272598800000]
  | readonly ['永観', -31133494800000]
  | readonly ['寛和', -31071200400000]
  | readonly ['永延', -31009338000000]
  | readonly ['永祚', -30935120400000]
  | readonly ['正暦', -30896931600000]
  | readonly ['長徳', -30760419600000]
  | readonly ['長保', -30638682000000]
  | readonly ['寛弘', -30464586000000]
  | readonly ['長和', -30196227600000]
  | readonly ['寛仁', -30061184400000]
  | readonly ['治安', -29940570000000]
  | readonly ['万寿', -29832483600000]
  | readonly ['長元', -29706339600000]
  | readonly ['長暦', -29431069200000]
  | readonly ['長久', -29317280400000]
  | readonly ['寛徳', -29191050000000]
  | readonly ['永承', -29145949200000]
  | readonly ['天喜', -28934442000000]
  | readonly ['康平', -28756890000000]
  | readonly ['治暦', -28537261200000]
  | readonly ['延久', -28421485200000]
  | readonly ['承保', -28252227600000]
  | readonly ['承暦', -28150621200000]
  | readonly ['永保', -28046682000000]
  | readonly ['応徳', -27952592400000]
  | readonly ['寛治', -27853059600000]
  | readonly ['嘉保', -27609930000000]
  | readonly ['永長', -27548499600000]
  | readonly ['承徳', -27517568400000]
  | readonly ['康和', -27463395600000]
  | readonly ['長治', -27322045200000]
  | readonly ['嘉承', -27253270800000]
  | readonly ['天仁', -27179830800000]
  | readonly ['天永', -27120214800000]
  | readonly ['永久', -27023360400000]
  | readonly ['元永', -26876134800000]
  | readonly ['保安', -26811766800000]
  | readonly ['天治', -26684758800000]
  | readonly ['大治', -26629635600000]
  | readonly ['天承', -26470746000000]
  | readonly ['長承', -26421411600000]
  | readonly ['保延', -26335702800000]
  | readonly ['永治', -26140784400000]
  | readonly ['康治', -26116160400000]
  | readonly ['天養', -26058013200000]
  | readonly ['久安', -26014640400000]
  | readonly ['仁平', -25840803600000]
  | readonly ['久寿', -25720794000000]
  | readonly ['保元', -25674915600000]
  | readonly ['平治', -25581085200000]
  | readonly ['永暦', -25556461200000]
  | readonly ['応保', -25506003600000]
  | readonly ['長寛', -25455286800000]
  | readonly ['永万', -25385994000000]
  | readonly ['仁安', -25348323600000]
  | readonly ['嘉応', -25265725200000]
  | readonly ['承安', -25200838800000]
  | readonly ['安元', -25067610000000]
  | readonly ['治承', -25003328400000]
  | readonly ['養和', -24877443600000]
  | readonly ['寿永', -24850832400000]
  | readonly ['元暦', -24790525200000]
  | readonly ['文治', -24749917200000]
  | readonly ['建久', -24602173200000]
  | readonly ['正治', -24317571600000]
  | readonly ['建仁', -24260029200000]
  | readonly ['元久', -24164989200000]
  | readonly ['建永', -24095523600000]
  | readonly ['承元', -24049818000000]
  | readonly ['建暦', -23941472400000]
  | readonly ['建保', -23854986000000]
  | readonly ['承久', -23686074000000]
  | readonly ['貞応', -23591552400000]
  | readonly ['元仁', -23509386000000]
  | readonly ['嘉禄', -23496598800000]
  | readonly ['安貞', -23413222800000]
  | readonly ['寛喜', -23375379600000]
  | readonly ['貞永', -23278698000000]
  | readonly ['天福', -23244397200000]
  | readonly ['文暦', -23196790800000]
  | readonly ['嘉禎', -23167501200000]
  | readonly ['暦仁', -23067709200000]
  | readonly ['延応', -23061402000000]
  | readonly ['仁治', -23017251600000]
  | readonly ['寛元', -22934739600000]
  | readonly ['宝治', -22806954000000]
  | readonly ['建長', -22741462800000]
  | readonly ['康元', -22505418000000]
  | readonly ['正嘉', -22491766800000]
  | readonly ['正元', -22426966800000]
  | readonly ['文応', -22392406800000]
  | readonly ['弘長', -22366314000000]
  | readonly ['文永', -22271187600000]
  | readonly ['建治', -21919280400000]
  | readonly ['弘安', -21829770000000]
  | readonly ['正応', -21508362000000]
  | readonly ['永仁', -21341955600000]
  | readonly ['正安', -21161638800000]
  | readonly ['乾元', -21049750800000]
  | readonly ['嘉元', -21025558800000]
  | readonly ['徳治', -20920150800000]
  | readonly ['延慶', -20861917200000]
  | readonly ['応長', -20783638800000]
  | readonly ['正和', -20753744400000]
  | readonly ['文保', -20599606800000]
  | readonly ['元応', -20531091600000]
  | readonly ['元亨', -20472858000000]
  | readonly ['正中', -20354144400000]
  | readonly ['嘉暦', -20309302800000]
  | readonly ['元徳', -20204499600000]
  | readonly ['元弘', -20142378000000, '南']
  | readonly ['正慶', -20120346000000, '北']
  | readonly ['建武', -20064099600000]
  | readonly ['延元', -19997744400000, '南']
  | readonly ['興国', -19867712400000, '南']
  | readonly ['正平', -19657674000000, '南']
  | readonly ['建徳', -18913856400000, '南']
  | readonly ['文中', -18859942800000, '南']
  | readonly ['天授', -18760496400000, '南']
  | readonly ['弘和', -18580784400000, '南']
  | readonly ['元中', -18479782800000, '南']
  | readonly ['暦応', -19918861200000, '北']
  | readonly ['康永', -19804035600000, '北']
  | readonly ['貞和', -19694912400000, '北']
  | readonly ['観応', -19556586000000, '北']
  | readonly ['文和', -19474938000000, '北']
  | readonly ['延文', -19365037200000, '北']
  | readonly ['康安', -19206838800000, '北']
  | readonly ['貞治', -19161478800000, '北']
  | readonly ['応安', -18990925200000, '北']
  | readonly ['永和', -18768186000000, '北']
  | readonly ['康暦', -18641005200000, '北']
  | readonly ['永徳', -18579574800000, '北']
  | readonly ['至徳', -18484966800000, '北']
  | readonly ['嘉慶', -18373078800000, '北']
  | readonly ['康応', -18328237200000, '北']
  | readonly ['明徳', -18293590800000, '北']
  | readonly ['応永', -18157683600000]
  | readonly ['正長', -17089261200000]
  | readonly ['永享', -17047789200000]
  | readonly ['嘉吉', -16686982800000]
  | readonly ['文安', -16593670800000]
  | readonly ['宝徳', -16420784400000]
  | readonly ['享徳', -16326608400000]
  | readonly ['康正', -16229667600000]
  | readonly ['長禄', -16163053200000]
  | readonly ['寛正', -16059027600000]
  | readonly ['文正', -15897718800000]
  | readonly ['応仁', -15863936400000]
  | readonly ['文明', -15795594000000]
  | readonly ['長享', -15222243600000]
  | readonly ['延徳', -15155802000000]
  | readonly ['明応', -15064131600000]
  | readonly ['文亀', -14792835600000]
  | readonly ['永正', -14698314000000]
  | readonly ['大永', -14145354000000]
  | readonly ['享禄', -13926157200000]
  | readonly ['天文', -13800358800000]
  | readonly ['弘治', -13068550800000]
  | readonly ['永禄', -12994074000000]
  | readonly ['元亀', -12609334800000]
  | readonly ['天正', -12506864400000]
  | readonly ['文禄', -11896189200000]
  | readonly ['慶長', -11772118800000]
  | readonly ['元和', -11181402000000]
  | readonly ['寛永', -10909501200000]
  | readonly ['正保', -10254934800000]
  | readonly ['慶安', -10152982800000]
  | readonly ['承応', -10009818000000]
  | readonly ['明暦', -9928602000000]
  | readonly ['万治', -9825699600000]
  | readonly ['寛文', -9738781200000]
  | readonly ['延宝', -9346266000000]
  | readonly ['天和', -9092941200000]
  | readonly ['貞享', -9017082000000]
  | readonly ['元禄', -8873485200000]
  | readonly ['宝永', -8385066000000]
  | readonly ['正徳', -8159389200000]
  | readonly ['享保', -7996438800000]
  | readonly ['元文', -7370730000000]
  | readonly ['寛保', -7217802000000]
  | readonly ['延享', -7123885200000]
  | readonly ['寛延', -6986941200000]
  | readonly ['宝暦', -6881014800000]
  | readonly ['明和', -6485130000000]
  | readonly ['安永', -6218586000000]
  | readonly ['天明', -5954374800000]
  | readonly ['寛政', -5707530000000]
  | readonly ['享和', -5326506000000]
  | readonly ['文化', -5231552400000]
  | readonly ['文政', -4784173200000]
  | readonly ['天保', -4384573200000]
  | readonly ['弘化', -3943933200000]
  | readonly ['嘉永', -3842154000000]
  | readonly ['安政', -3627882000000]
  | readonly ['万延', -3462858000000]
  | readonly ['文久', -3432186000000]
  | readonly ['元治', -3337664400000]
  | readonly ['慶応', -3303104400000]
  | readonly ['明治', -3216790800000]
  | readonly ['大正', -1812186000000]
  | readonly ['昭和', -1357635600000]
  | readonly ['平成', 600188400000]
  | readonly ['令和', 1556636400000]
)[]
export declare const 太陽: STAR
export declare const 地球: PLANET
export declare const 火星: PLANET
export declare const 水星: PLANET
export declare const 金星: PLANET
export declare const 木星: PLANET
export declare const 土星: PLANET
export declare const 天王星: PLANET
export declare const 海王星: PLANET
export declare const 冥王星: PLANET
export declare const セレス: PLANET
export declare const ハウメア: PLANET
export declare const マケマケ: PLANET
export declare const エリス: PLANET
export declare const 白分月: SATELLITE
export declare const 黒分月: SATELLITE
export declare const 月: SATELLITE
export declare const ガニメデ: SATELLITE
export declare const カリスト: SATELLITE
export declare const タイタン: SATELLITE
export declare const チタニア: SATELLITE
export declare const トリトン: SATELLITE
export declare const ナマカ: SATELLITE
export declare const ヒイアカ: SATELLITE
export declare const カロン: SATELLITE
export declare const ディスノミア: SATELLITE
export declare const 東京: SPOT
export declare const zürich: SPOT
export declare const Paris: SPOT
export declare const Romus: SPOT
export declare const London: SPOT
export declare const NewYork: SPOT
export declare const NewYork_Summer: SPOT
export declare const Madurai: SPOT
export declare const Jaypore: SPOT
export declare const Calendar: {
  UTC: FancyDate
  Gregorian: FancyDate
  Julian: FancyDate
  アマンタ: FancyDate
  プールニマンタ: FancyDate
  平気法: FancyDate
  Romulus: FancyDate
  MarsGregorian: FancyDate
  Jupiter: FancyDate
  フランス革命暦: FancyDate
  Beat: FancyDate
}
